{
  "": "",
  "Choi Uri": "Choi Uri",
  "Portfolio": "Portfolio",
  "Front-End Developer": "Front-End Developer",
  "About Yuri": "About Yuri",
  "협업과 지식 공유를 중요시하는 프론트엔드 개발자 입니다.": "I am a front-end developer who values collaboration and knowledge sharing.",
  "다른 동료들과 함께 지식을 나누고 함께 성장하는 것에 큰 관심을 가지고 있습니다.": "I have a strong interest in sharing knowledge and growing together with my colleagues.",
  "시각적 피드백과 즉각적인 결과물에서 성취감을 느껴 프론트엔드 개발을 시작하였습니다.": "I began front-end development for the satisfaction of visual feedback and instant outcomes.",
  "어떻게든 해내겠다는 의지와 쉽게 포기하지않는 근성이 저의 장점입니다.": "My determination to find a way and my perseverance not to give up easily are my strengths.",
  "롤 악성 유저 신고 서비스": "Report Service for Malicious Users in League of Legends",
  "팀 프로젝트": "Team Project",
  "프로젝트 기간": "Project Duration",
  "사용한 기술스텍": "Used Technology Stack",
  "프로젝트 설명": "Project Description",
  "< 상세보기 >": "< Details >",
  "< 요약보기 >": "< Summary >",
  "게임 내에서 욕설을 하는 악성 유저를 신고하는 커뮤니티,게임 화면을 캡처해서 올릴 수 있으며 라이엇 API와 연동해 게임 유저를 검색 할 수 있다.": "Reporting service for toxic players who use profanity in the game, allowing users to capture and upload game screens. It integrates with Riot API to search for game users.",
  "주요 기능": "Key functions",
  "다국어 처리, 반응형, 유저 검색, 파일 업로드, 랭킹 조회": "Multilingual support, responsive design, user search, file upload, ranking",
  "프로젝트에 기여한점": "Contributions to the Project",
  "타입스크립트와 반응형을 도전과제로 구현": "Implemented TypeScript and responsiveness as challenging tasks",
  "axios interceptor에서 http method 호출 및 응답 try-catch 코드 추상화 진행": "abstracting try-catch code for HTTP calls and responses in an axios interceptor.",
  "해외게임 특성상 react-i18next를 사용하여 다국어 처리함.": "Due to the nature of international gaming, multilingual support is implemented using react-i18next.",
  "항해캡슐": "Hanghae Capsule",
  "부트캠프를 잘 완수한 나에게 쓰는 타임캡슐 서비스": "A Time Capsule Service Written to Myself Who Successfully Completed the Bootcamp",
  "부트캠프 시작전에 수료시점의 나에게 타임캡슐을 작성하는 서비스이며 독학하면서 구현에만 급급했던 코드와 유지 보수성을 고려한 코드의 차이점을 직접 비교해보기 위해 V2구현": "A service that allows you to write a time capsule to yourself at the completion point before starting the bootcamp. Implemented a V2 to directly compare the differences between the code hastily written during self-study and the code with considerations for maintainability.",
  "편지 작성, 이메일 인증, 응원글 작성, 타이머": "Letter writing, email verification, message of support, timer",
  "새로고침 시 편지 내용이 초기화되는 걸 방지 및 최초로 인증번호 발송한 이메일과 동일한 이메일로 재발송 요청인지 구분하기 위함": "Prevent letter content reset on refresh and distinguish resend requests with the same initial verification email.",
  "header를 컴포넌트마다 넣지 않고 Layout으로 관리 - 코드의 간결성을 위함.": "Manage header via Layout for code simplicity.",
  "API 요청 fetch → Axios": "API Request fetch → Axios",
  "자동으로 JSON 변환을 해주며, 더 편리하게 작업할 수 있는 API 디자인을 가짐.": "Automatically converts to JSON and has a more user-friendly API design for convenient operations.",
  "서울 내 외국어 가능 약국 찾기 서비스": "Service for Finding Pharmacies in Seoul with Foreign Language Assistance",
  "1999년도부터 2017년까지 외국인들의 의료시설 이용 불편의 문제가 해결되지 않았고, 2021년에는 설문조사를 바탕으로 작성된 논문에서도 같은 문제가 여전히 해결되지 않았음. 이러한 배경으로 외국어 구사가 가능한 약국 정보를 제공하는 프로젝트를 계획": "A project aimed at offering foreign language support for finding pharmacies, addressing ongoing issues faced by foreigners in accessing healthcare facilities from 1999 to 2017, as indicated in a 2021 survey-based paper.",
  "지도 API, 조건별 검색필터, 댓글기능, 마이페이지, 북마크, 랭킹 조회": "Map API, conditional search filters, comment functionality, My Page, bookmarks, and ranking search",
  "전체 UI/UX 전부 구현": "Implemented the entire UI/UX.",
  "약국 검색 조건 값이 초기화되어 불편하다는 의견을 해결하고자 recoil 적용하여 해결": "Addressed the inconvenience of resetting pharmacy search filter values by implementing Recoil.",
  "버튼 연속 클릭시 500에러 발생 하여 `디바운싱` 기능을 통해 북마크의 연속클릭을 제한함": "Resolved the issue of 500 errors occurring with consecutive button clicks by implementing the 'debounce' feature to limit consecutive bookmark actions.",
  "KakaoMap Api 연동": "KakaoMap Api interlock",
  "웹표준을 준수합니다.": "Complies with\r\nweb standards.",
  "애니메이션\r\n크로스브라우징": "Animation\r\nCross-Browser Compatibility",
  "ES6문법에 익숙합니다.\r\n엔진 동작 원리에 관심이 많습니다.": "Familiar with ES6 syntax,\r\n keen on engine operation principles.",
  "컴포넌트 재사용\r\n랜더링 최적화": "Component Reuse\r\nRendering Optimization",
  "Redux\n\r활용한 전역 상태 관리": "Global State Management Using Redux",
  "Recoil\n\r활용한 전역 상태 관리": "Global State Management Using Recoil",
  "props를 통한 동적 스타일링에 관심이 많습니다.": "interested in dynamic styling through props.",
  "Figma로 디자이너와\n\r협업이 가능합니다.": "collaborate with designers using Figma.",
  "형상관리 및 협업\n\rFork,PR 활용": "Version Control and Collaboration\n\rUsing Fork and PR",
  "Vercel을 활용한\n\r정적 페이지 배포 경험": "Vercel for Static Page Deployment Experience",
  "최유리": "URI CHOI",
  "부트캠프 항해99 14기": "Bootcamp HangHae99 14th ",
  "부트캠프 참여 동기": "Partimotivation",
  "여러 프로젝트를 경험해보고 같은 꿈을 목표로 하는 사람들과 함께 공부하면서 동기부여되기 위해 참여함.": "Joining to find motivation through collaborative learning on shared dreams and projects.",
  "스파르타 코딩클럽 온라인 부트캠프 항해99 14기 리액트 교육과정": "Sparta Coding Club Online Bootcamp Hanghae99 14th Cohort React Education Program",
  "약 100명의 교육생 중 6명에게만 부여되는 장학생으로 선정": "About 100 students, only 6 awarded scholarship.",
  "장학생 수료증 확인": "Scholarship Certificate Verification",
  "미니프로젝트, 클론프로젝트, 최종 팀 프로젝트 진행": "Mini project, clone project, and final team project in progress.",
  "3개월동안 여러번의 팀 프로젝트 과정을 통해 다른 직군과의 협업과정 경험.": "3 months, diverse team project collaborations.",
  "성동글로벌경영고등학교 인터넷 MD과 졸업": "Graduated from Sungdong Global Business High School, Internet MD",
  "프론트 언어기술 스터디": "Front-end Language Technology Study",
  "구경가기": "Take a look",
  "진행동기": "motivation",
  "혼자서 공부하는 것보단 같이 공부하는게 지속 가능하고 부족한 의지를 같이 동기부여해서 나아갈 수 있다고 생각해서 스터디를 개설": "I formed a study group for mutual inspiration and motivation in collaborative learning.",
  "진행방향": "Progress",
  "프론트 언어기술에 대해 공부 후 발표": "Study and present on front-end language technology.",
  "공통적인 질문에 대한 답변 준비 후 베스트 답변 선정하는 방식으로 스터디 진행 - 프로젝트 주차에는 스터디의 부담을 줄이고자 조금 더 간단한 방법으로 스터디를 진행": "Preparing answers for common questions and selecting the best responses during study sessions. Simplifying study during project weeks to reduce the load.",
  "모던 자바스크립트 딥다이브 스터디 진행 및 언어기술 질문 공부 및 발표": "Modern JavaScript Study with Language Tech Q&A.",
  "주 1회 진행": "Once a week"
}
